In [20]:
# Import Libraries
import pandas as pd
from bs4 import BeautifulSoup
import requests

In [21]:
# assign URL to be scraped to a variable
url = "https://www.codeacademy.com/"

In [22]:
# send request to download the data from URL
response = requests.request("GET", url)

In [23]:
# create BS object, use HTML parser to parse the page's text
data = BeautifulSoup(response.text, 'html.parser')

In [24]:
#print first header of page
print(data.html.h1)

<h1 class="gamut-nfav5q-Text-Header e1gidkku0">Join the millions learning to code with Codecademy for free</h1>

In [25]:
# instantiate list to append some content
content = []

In [26]:
# use beautifulsoup's find_all method to find all paragraph tags
words = data.find_all('p')

In [27]:
# Iterate through all paragraph tags, append text to list with for loop
for word in words:
    content.append(word.text)

In [28]:
# check content appended
print(content)

['Codecademy requires that you have a secure password. If your password is too weak, make sure you:', "By signing up for Codecademy, you agree to Codecademy's Terms of Service & Privacy Policy.", 'Explore All', 'Javascript', 'Explore All', 'Python', 'Explore All', 'Web Development', 'Explore All', 'Data Science']

In [29]:
df = pd.DataFrame(content, columns= ['Text'])

In [30]:
# check scraped dataframe
print(df)

                                                Text
0  Codecademy requires that you have a secure pas...
1  By signing up for Codecademy, you agree to Cod...
2                                        Explore All
3                                         Javascript
4                                        Explore All
5                                             Python
6                                        Explore All
7                                    Web Development
8                                        Explore All
9                                       Data Science

In [5]:
import sqlite3

In [6]:
conn = sqlite3.connect("test.db", timeout=10)
cursor = conn.cursor()

In [7]:
cursor.execute('''CREATE TABLE students (
                    id INTEGER PRIMARY KEY, 
                    name TEXT NOT NULL, 
                    email TEXT NOT NULL UNIQUE, 
                    major_code INTEGER, 
                    grad_date datetime, 
                    grade REAL NOT NULL)''')

OperationalError: table students already exists

In [11]:
cursor.execute('''INSERT INTO students VALUES (101, 'Alex', 'alex@codeu.com', 32, '2022-05-16', 'Pass') ''')

In [10]:
students = [(102, 'Joe', 'joseph@codeu.com', 32, '2022-05-16', 'Pass'), (103, 'Stacy', 'stacy@codeu.com', 10, '2022-05-16', 'Pass'), (104, 'Angela', 'angela@codeu.com', 21, '2022-12-20', 'Pass'), (105, 'Mark', 'mark@codeu.com', 21, '2022-12-20', 'Fail'), (106, 'Nathan', 'nathaniel@codeu.com', 21, '2022-12-20', 'Pass')
]

In [12]:
cursor.executemany('''INSERT INTO students VALUES (?,?,?,?,?,?)''', students)

In [13]:
for row in cursor.execute("SELECT * FROM students"):
    print(row)

(101, 'Alex', 'alex@codeu.com', 32, '2022-05-16', 'Pass')
(102, 'Joe', 'joseph@codeu.com', 32, '2022-05-16', 'Pass')
(103, 'Stacy', 'stacy@codeu.com', 10, '2022-05-16', 'Pass')
(104, 'Angela', 'angela@codeu.com', 21, '2022-12-20', 'Pass')
(105, 'Mark', 'mark@codeu.com', 21, '2022-12-20', 'Fail')
(106, 'Nathan', 'nathaniel@codeu.com', 21, '2022-12-20', 'Pass')

In [14]:
cursor.execute("SELECT * FROM students").fetchone()

(101, 'Alex', 'alex@codeu.com', 32, '2022-05-16', 'Pass')

In [15]:
cursor.execute("SELECT * FROM students").fetchmany(3)

[(101, 'Alex', 'alex@codeu.com', 32, '2022-05-16', 'Pass'),
 (102, 'Joe', 'joseph@codeu.com', 32, '2022-05-16', 'Pass'),
 (103, 'Stacy', 'stacy@codeu.com', 10, '2022-05-16', 'Pass')]

In [16]:
cursor.execute("SELECT * FROM students").fetchall()

[(101, 'Alex', 'alex@codeu.com', 32, '2022-05-16', 'Pass'),
 (102, 'Joe', 'joseph@codeu.com', 32, '2022-05-16', 'Pass'),
 (103, 'Stacy', 'stacy@codeu.com', 10, '2022-05-16', 'Pass'),
 (104, 'Angela', 'angela@codeu.com', 21, '2022-12-20', 'Pass'),
 (105, 'Mark', 'mark@codeu.com', 21, '2022-12-20', 'Fail'),
 (106, 'Nathan', 'nathaniel@codeu.com', 21, '2022-12-20', 'Pass')]

In [17]:
cursor.execute("""SELECT COUNT(*) FROM students WHERE Grade = 'Pass'; """).fetchone()

(5,)

In [18]:
major_codes = cursor.execute("SELECT major_code FROM students;").fetchall()

sum = 0
for num in major_codes:
    for i in num:
        sum = sum + i

average = sum / len(major_codes)

# show average
print(average)

22.833333333333332

In [31]:
_df = pd.read_sql_query('''SELECT * from students;''', conn)
print(_df)

    id    name                email  major_code   grad_date grade
0  101    Alex       alex@codeu.com          32  2022-05-16  Pass
1  102     Joe     joseph@codeu.com          32  2022-05-16  Pass
2  103   Stacy      stacy@codeu.com          10  2022-05-16  Pass
3  104  Angela     angela@codeu.com          21  2022-12-20  Pass
4  105    Mark       mark@codeu.com          21  2022-12-20  Fail
5  106  Nathan  nathaniel@codeu.com          21  2022-12-20  Pass

In [32]:
_df['major_code'].mean()

22.833333333333332

In [34]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [35]:
connection = sqlite3.connect("titanic.db")
_cursor = connection.cursor()
df.to_sql("titanic", connection)

ValueError: Table 'titanic' already exists.

In [36]:
_cursor.execute("SELECT * from titanic;").fetchmany(5)

[(0,
  1,
  0,
  3,
  'Braund, Mr. Owen Harris',
  'male',
  22.0,
  1,
  0,
  'A/5 21171',
  7.25,
  None,
  'S'),
 (1,
  2,
  1,
  1,
  'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
  'female',
  38.0,
  1,
  0,
  'PC 17599',
  71.2833,
  'C85',
  'C'),
 (2,
  3,
  1,
  3,
  'Heikkinen, Miss. Laina',
  'female',
  26.0,
  0,
  0,
  'STON/O2. 3101282',
  7.925,
  None,
  'S'),
 (3,
  4,
  1,
  1,
  'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
  'female',
  35.0,
  1,
  0,
  '113803',
  53.1,
  'C123',
  'S'),
 (4,
  5,
  0,
  3,
  'Allen, Mr. William Henry',
  'male',
  35.0,
  0,
  0,
  '373450',
  8.05,
  None,
  'S')]

In [37]:
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [59]:
_cursor.execute("SELECT Name FROM titanic WHERE Age >= 50.0;").fetchall()

[('McCarthy, Mr. Timothy J',),
 ('Bonnell, Miss. Elizabeth',),
 ('Hewlett, Mrs. (Mary D Kingcome) ',),
 ('Wheadon, Mr. Edward H',),
 ('Ostby, Mr. Engelhart Cornelius',),
 ('Coxon, Mr. Daniel',),
 ('Goldschmidt, Mr. George B',),
 ('Connors, Mr. Patrick',),
 ('White, Mr. Percival Wayland',),
 ('Bateman, Rev. Robert James',),
 ('Meo, Mr. Alfonzo',),
 ('Williams, Mr. Charles Duane',),
 ('Van der hoef, Mr. Wyckoff',),
 ('Smith, Mr. James Clinch',),
 ('Isham, Miss. Ann Elizabeth',),
 ('Lurette, Miss. Elise',),
 ('Green, Mr. George Henry',),
 ('Sjostedt, Mr. Ernst Adolf',),
 ('Carter, Rev. Ernest Courtenay',),
 ('Stead, Mr. William Thomas',),
 ('Parrish, Mrs. (Lutie Davis)',),
 ('Taussig, Mr. Emil',),
 ('Graham, Mrs. William Thompson (Edith Junkins)',),
 ('Andrews, Miss. Kornelia Theodosia',),
 ('Duane, Mr. Frank',),
 ('Baxter, Mrs. James (Helene DeLaudeniere Chaput)',),
 ('Moraweck, Dr. Ernest',),
 ('Nysveen, Mr. Johan Hansen',),
 ('Warren, Mrs. Frank Manley (Anna Sophia Atkinson)',),
 ('Widegren, Mr. Carl/Charles Peter',),
 ('Silvey, Mr. William Baird',),
 ('Fortune, Mr. Mark',),
 ('Peuchen, Major. Arthur Godfrey',),
 ('Millet, Mr. Francis Davis',),
 ('Toomey, Miss. Ellen',),
 ('Smart, Mr. John Montgomery',),
 ('Rouse, Mr. Richard Henry',),
 ('Turkula, Mrs. (Hedwig)',),
 ('Kent, Mr. Edward Austin',),
 ('Molson, Mr. Harry Markland',),
 ('Artagaveytia, Mr. Ramon',),
 ('Eustis, Miss. Elizabeth Mussey',),
 ('Rothschild, Mrs. Martin (Elizabeth L. Barrett)',),
 ('Ridsdale, Miss. Lucy',),
 ('Douglas, Mr. Walter Donald',),
 ('Nicholson, Mr. Arthur Ernest',),
 ('Wright, Mr. George',),
 ('Harris, Mr. George',),
 ('Appleton, Mrs. Edward Dale (Charlotte Lamson)',),
 ('Downton, Mr. William James',),
 ('Frolicher-Stehli, Mr. Maxmillian',),
 ('Stephenson, Mrs. Walter Bertram (Martha Eustis)',),
 ('Sutton, Mr. Frederick',),
 ('Kirkland, Rev. Charles Leonard',),
 ('Barkworth, Mr. Algernon Henry Wilson',),
 ('Lundahl, Mr. Johan Svensson',),
 ('Simonius-Blumer, Col. Oberst Alfons',),
 ('Newell, Mr. Arthur Webster',),
 ('Frauenthal, Dr. Henry William',),
 ('Mitchell, Mr. Henry Michael',),
 ('Brown, Mr. Thomas William Solomon',),
 ('Weir, Col. John',),
 ('Chapman, Mr. Charles Henry',),
 ('Greenberg, Mr. Samuel',),
 ('Hodges, Mr. Henry Price',),
 ('Crosby, Capt. Edward Gifford',),
 ('Hogeboom, Mrs. John C (Anna Andrews)',),
 ('Mack, Mrs. (Mary)',),
 ('Hocking, Mrs. Elizabeth (Eliza Needs)',),
 ('Hays, Mrs. Charles Melville (Clara Jennings Gregg)',),
 ('Stone, Mrs. George Nelson (Martha Evelyn)',),
 ('Svensson, Mr. Johan',),
 ('Daly, Mr. Peter Denis ',),
 ('Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)',)]

In [39]:
_cursor.execute("SELECT Name FROM titanic WHERE Age = 50.0;").fetchall()

[('Isham, Miss. Ann Elizabeth',),
 ('Parrish, Mrs. (Lutie Davis)',),
 ('Baxter, Mrs. James (Helene DeLaudeniere Chaput)',),
 ('Silvey, Mr. William Baird',),
 ('Toomey, Miss. Ellen',),
 ('Rouse, Mr. Richard Henry',),
 ('Ridsdale, Miss. Lucy',),
 ('Douglas, Mr. Walter Donald',),
 ('Frauenthal, Dr. Henry William',),
 ('Hodges, Mr. Henry Price',)]

In [57]:
femme = _cursor.execute("""SELECT COUNT(*) FROM titanic WHERE Sex = 'female'; """).fetchone()
print(femme)

(314,)

In [56]:
new_df = pd.read_sql_query('''SELECT * from titanic;''', connection)
new_df

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

In [142]:
import requests
from bs4 import BeautifulSoup

#webpage_response = requests.get('https://towardsdatascience.com/making-docker-and-conda-play-well-together-eda0ff995e3c')
webpage_response = requests.get('https://content.codecademy.com/courses/beautifulsoup/shellter.html')
prefix = "https://content.codecademy.com/courses/beautifulsoup/"

_webpage = webpage_response.content
soup = BeautifulSoup(_webpage, "html.parser")

In [143]:
webpage_links = soup.find_all("a")
links = []
turtle_data = {}

In [144]:
for link in webpage_links:
    links.append(prefix+link["href"])

In [145]:
# follow the links loop
for link in links:
    webpage = requests.get(link)
    _turtle = BeautifulSoup(webpage.content, "html.parser")

    turtle_name = _turtle.select("name")
    print(turtle_name)

[]
[]
[]
[]
[]
[]
[]
[]
[]